#include <iostream>
#include "Set.h"

//Реализовать ассоциативный массив с ключами и значениями типа string на основе АВЛ - дерева.
//Должны поддерживаться следующие операции :

//Добавить значение по заданному ключу в ассоциативный массив.Если такой ключ уже есть, значение заменяется на новое.
//Получить значение по заданному ключу из ассоциативного массива.Если такого ключа нет, возвращается пустая строка.
//Проверить наличие заданного ключа.
//Удалить заданный ключ и связанное с ним значение из ассоциативного массива.Если такого ключа нет, функция ничего 
//не делает.
//Ассоциативный массив должен быть реализован отдельным модулем.

using namespace std;

int main()
{
	return 0;
}